In [58]:
import pandas as pd

df = pd.DataFrame({
    "Name": ["A", "B", "C"],
    "Age": [25, 30, 22],
    "Salary": [50000, 60000, 40000]
})

print(df)

  Name  Age  Salary
0    A   25   50000
1    B   30   60000
2    C   22   40000

In [59]:
# Remove one column
df1 = df.drop("Salary", axis=1)
print(df1)

  Name  Age
0    A   25
1    B   30
2    C   22

In [60]:
# Remove multiple columns
df2 = df.drop(["Age", "Salary"], axis=1)
print(df2)

  Name
0    A
1    B
2    C

In [61]:
# Remove row at index 1
df1 = df.drop(1)
print(df1)

  Name  Age  Salary
0    A   25   50000
2    C   22   40000

In [62]:
# Remove multiple rows
df2 = df.drop([0, 2])
print(df2)

  Name  Age  Salary
1    B   30   60000

In [63]:
# Remove rows where Age < 25
df1 = df[df["Age"] >= 25]
print(df1)

  Name  Age  Salary
0    A   25   50000
1    B   30   60000

In [64]:
df = pd.DataFrame({
    "Name": ["A", "B", "A", "C", "B"],
    "Age": [25, 30, 25, 22, 30]
})
print(df)

  Name  Age
0    A   25
1    B   30
2    A   25
3    C   22
4    B   30

In [65]:
# Remove duplicate rows
df1 = df.drop_duplicates()
print(df1)

  Name  Age
0    A   25
1    B   30
3    C   22

In [66]:
# Remove duplicates only based on "Name"
df2 = df.drop_duplicates(subset=["Name"])
print(df2)

  Name  Age
0    A   25
1    B   30
3    C   22

In [67]:
df = pd.DataFrame({
    "Name": ["A", None, "C"],
    "Age": [25, None, 22]
})
print(df)

   Name   Age
0     A  25.0
1  None   NaN
2     C  22.0

In [68]:
# Drop rows with any NaN
df1 = df.dropna()
print(df1)

  Name   Age
0    A  25.0
2    C  22.0

In [69]:
# Drop rows where all values are NaN
df2 = df.dropna(how="all")
print(df2)

  Name   Age
0    A  25.0
2    C  22.0

In [70]:
# Drop rows where Age is NaN only
df3 = df.dropna(subset=["Age"])
print(df3)

  Name   Age
0    A  25.0
2    C  22.0